app/views/tasks/destroy.js.erb

var message = document.createElement('p');
message.innerText = "タスク「<%= @task.name %>」を削除しました。残りのタスクは<%= Task.count %>件です。"
---
SELECT COUNT(*) FROM "tasks"