app/controllers/tasks_controller.rb

  def index
    @q = current_user.tasks.ransack(params[:q])
    @tasks = @q.result(distinct: true).page(params[:page])
---
SELECT COUNT(count_column) FROM (SELECT  DISTINCT "tasks"."id" AS count_column FROM "tasks" WHERE "tasks"."user_id" = $1 LIMIT $2 OFFSET $3) subquery_for_count  [["user_id", 2], ["LIMIT", 25], ["OFFSET", 0]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 6], ["LIMIT", 1]]

  def create
    @task = current_user.tasks.new(task_params)

    if params[:back]
      render :new
      return
    end

    if @task.save
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "ああああああああああああああああああ"], ["description", "あああああああああああああああああああああああああ"], ["created_at", "2019-01-05 05:52:12.937037"], ["updated_at", "2019-01-05 05:52:12.937037"], ["user_id", 2]]

  def update
    @task.update!(task_params)
---
UPDATE "tasks" SET "updated_at" = $1 WHERE "tasks"."id" = $2  [["updated_at", "2019-01-05 04:21:18.972557"], ["id", 11]]

  def set_task
    @task = current_user.tasks.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 41], ["LIMIT", 1]]