app/controllers/tasks_controller.rb

  def create
    @task = current_user.tasks.new(task_params)
    if @task.save
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "墓参り"], ["description", "ばあちゃんに会いに行く"], ["created_at", "2019-01-02 07:51:15.623962"], ["updated_at", "2019-01-02 07:51:15.623962"], ["user_id", 2]]

  def update
    @task.update!(task_params)
---
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "ばあちゃんに会いに行く\r\nhttps://www.aoyamaflowermarket.com/"], ["updated_at", "2019-01-02 08:06:42.478151"], ["id", 6]]

  def set_task
    @task = current_user.tasks.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 7], ["LIMIT", 1]]