app/models/task.rb

INSERT INTO "tasks" ("name", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "魚を焼く"], ["description", "8時間焼く"], ["created_at", "2019-01-05 04:59:57.661975"], ["updated_at", "2019-01-05 04:59:57.661975"], ["user_id", 2]]
---
      task = new
      task.attributes = row.to_hash.slice(*csv_attributes)
      task.save!